packages/pytest-httpchain-models/tests/test_type_validators/xml_with_namespace.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soap:Header>
        <auth:Token xmlns:auth="http://example.com/auth">secret-token</auth:Token>
    </soap:Header>
    <soap:Body>
        <ns:GetUser xmlns:ns="http://example.com/users">
            <ns:UserId>123</ns:UserId>
        </ns:GetUser>
    </soap:Body>
</soap:Envelope>
